# gui_server2.py

'''

    Во втором варианте малина с денежным терминалом это клиент.
    Все малины на постах это сокет серверы.

    На малине с дентерминалом происходит опрос постовых малин каждую секунду,
    сколько у них денег.
    эта информация видна в окне дентерминала, для каждого поста.
    Сделаю одно окно.
    Когд чел вносит деньги он видит свою сумму на экране, нажав на кнопку с нужным
    постом, он тем самым отправит деньги.
    Для надежности можно сделать что бы чел зажал кнопку, или нажал два раза.

'''

